tap "felixkratz/formulae"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "pkgxdev/made"
tap "supabase/tap"
tap "theboredteam/boring-notch"
tap "tw93/tap"
brew "bat"
brew "btop"
brew "cocoapods"
brew "curl"
brew "emacs"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "icu4c@76"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lsd"
brew "lua"
brew "node"
brew "openjdk@17"
brew "pillow"
brew "pkgconf"
brew "powerlevel10k"
brew "python@3.12"
brew "ripgrep"
brew "sl"
brew "snitch"
brew "supabase"
brew "switchaudio-osx"
brew "thefuck"
brew "tlrc"
brew "typst"
brew "watchman"
brew "witr"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"
brew "pkgxdev/made/pkgx"
brew "tw93/tap/mole"
cask "android-studio"
cask "backdrop"
cask "cursor"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-pro"
cask "mitmproxy"
cask "ngrok"
cask "nordvpn"
cask "notion"
cask "rectangle"
cask "sf-symbols"
cask "stats"
cask "taphouse"
cask "warp"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "anysphere.cursorpyright"
vscode "austenc.tailwind-docs"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "bourhaouta.tailwindshades"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "brapifra.phpserver"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "hb432.prettier-eslint-typescript"
vscode "janne252.fontawesome-autocomplete"
vscode "johnpapa.vscode-peacock"
vscode "knisterpeter.vscode-github"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "million.million-lint"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "myriad-dreamin.tinymist"
vscode "myriad-dreamin.tinymist-vscode-html"
vscode "naqvi.es7-react-snippets"
vscode "nize.oklch-preview"
vscode "orangex4.vscode-typst-sync"
vscode "pranaygp.vscode-css-peek"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "rvest.vs-code-prettier-eslint"
vscode "sivaprasadnk.coffee-brown"
vscode "stivo.tailwind-fold"
vscode "surv.typst-math"
vscode "tal7aouy.theme"
vscode "tomoki1207.pdf"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wallabyjs.quokka-vscode"
vscode "whizkydee.material-palenight-theme"
vscode "yoavbls.pretty-ts-errors"
vscode "zarifprogrammer.tailwind-snippets"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"
