tap "felixkratz/formulae"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "pkgxdev/made"
tap "theboredteam/boring-notch"
brew "bat"
brew "btop"
brew "cmake"
brew "cocoapods"
brew "curl"
brew "emacs"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-flow"
brew "git-lfs"
brew "icu4c@76"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lua"
brew "neovim"
brew "node"
brew "nowplaying-cli"
brew "openjdk@17"
brew "php"
brew "pillow"
brew "pkgconf"
brew "pnpm"
brew "powerlevel10k"
brew "python@3.12"
brew "ripgrep"
brew "sl"
brew "switchaudio-osx"
brew "tasksh"
brew "thefuck"
brew "timewarrior"
brew "tlrc"
brew "todo-txt"
brew "typst"
brew "watchman"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"
brew "pkgxdev/made/pkgx"
cask "android-studio"
cask "backdrop"
cask "basictex"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-pro"
cask "notion"
cask "rectangle"
cask "sf-symbols"
cask "stats"
cask "warp"
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "austenc.tailwind-docs"
vscode "benjaminbenais.copilot-theme"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bourhaouta.tailwindshades"
vscode "bradlc.vscode-tailwindcss"
vscode "brapifra.phpserver"
vscode "burkeholland.simple-react-snippets"
vscode "calebfiggers.typst-companion"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "equimper.react-native-react-redux"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gluestack.gluestack-vscode"
vscode "hb432.prettier-eslint-typescript"
vscode "hediet.vscode-drawio"
vscode "janne252.fontawesome-autocomplete"
vscode "johnpapa.vscode-peacock"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mgmcdermott.vscode-language-babel"
vscode "million.million-lint"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "myriad-dreamin.tinymist"
vscode "myriad-dreamin.tinymist-vscode-html"
vscode "nize.oklch-preview"
vscode "orangex4.vscode-typst-sync"
vscode "pptxviewerpro.pptx-viewer-pro"
vscode "pranaygp.vscode-css-peek"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "rvest.vs-code-prettier-eslint"
vscode "stivo.tailwind-fold"
vscode "surv.typst-math"
vscode "swiftlang.swift-vscode"
vscode "tomoki1207.pdf"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wallabyjs.quokka-vscode"
vscode "whizkydee.material-palenight-theme"
vscode "woodreamz.es7-react-js-snippets"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"
